## Terraform Plan 📖
<details>
<summary>Click to expand</summary>

```HCL
module.master_nodes[0].proxmox_vm_qemu.vm: Refreshing state... [id=pve/qemu/200]
module.worker_nodes[0].proxmox_vm_qemu.vm: Refreshing state... [id=pve/qemu/201]
module.worker_nodes[1].proxmox_vm_qemu.vm: Refreshing state... [id=pve/qemu/202]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.master_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.3.0-20260204115612" -> "packer-debian-13.3.0-20260205104558" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.50" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/200" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-master-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.50" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;master" -> "k3s,master"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:1a:df:06" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:e0:be:f9" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "b7bc029d-4861-4aad-8c52-989fba0c9544" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.worker_nodes[0].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.3.0-20260204115612" -> "packer-debian-13.3.0-20260205104558" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.51" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/201" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-worker-01"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.51" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:57:2e:25" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:c6:93:1a" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "13c7eef1-b1e6-401c-8cc4-e1416f87b21c" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.worker_nodes[1].proxmox_vm_qemu.vm must be replaced
-/+ resource "proxmox_vm_qemu" "vm" {
      + bootdisk                  = (known after apply)
      ~ clone                     = "packer-debian-13.3.0-20260204115612" -> "packer-debian-13.3.0-20260205104558" # forces replacement
      - cores                     = 0 -> null
      ~ current_node              = "pve" -> (known after apply)
      ~ default_ipv4_address      = "10.9.9.52" -> (known after apply)
      + default_ipv6_address      = (known after apply)
      ~ id                        = "pve/qemu/202" -> (known after apply)
      ~ linked_vmid               = 0 -> (known after apply)
        name                      = "kube-worker-02"
      - numa                      = false -> null
      - qemu_os                   = "l26" -> null
      ~ reboot_required           = false -> (known after apply)
      - sockets                   = 0 -> null
      ~ ssh_host                  = "10.9.9.52" -> (known after apply)
      ~ ssh_port                  = "22" -> (known after apply)
      ~ sshkeys                   = (sensitive value)
      ~ tags                      = "k3s;worker" -> "k3s,worker"
      ~ unused_disk               = [] -> (known after apply)
      - vcpus                     = 0 -> null
        # (39 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide2 {
                  - ignore = false -> null

                    # (1 unchanged block hidden)
                }
            }
          ~ virtio {
              ~ virtio0 {
                  - ignore = false -> null

                  ~ disk {
                      ~ id                   = 0 -> (known after apply)
                      ~ linked_disk_id       = -1 -> (known after apply)
                      - readonly             = false -> null
                      - replicate            = false -> null
                        # (20 unchanged attributes hidden)
                    }
                }
            }
        }

      ~ network {
            id        = 0
          ~ macaddr   = "bc:24:11:52:61:7e" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }
      ~ network {
            id        = 1
          ~ macaddr   = "bc:24:11:a7:0d:2e" -> (known after apply)
          - mtu       = 0 -> null
          - queues    = 0 -> null
          - rate      = 0 -> null
          - tag       = 0 -> null
            # (4 unchanged attributes hidden)
        }

      ~ smbios (known after apply)
      - smbios {
          - uuid         = "b29f0b4d-991e-4f8a-aab8-0ab9a29b4256" -> null
            # (6 unchanged attributes hidden)
        }

      - startup_shutdown {
          - order            = -1 -> null
          - shutdown_timeout = -1 -> null
          - startup_delay    = -1 -> null
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
```

</details>

*Pusher: @MrStarktastic, Action: `pull_request`*
<!-- Sticky Pull Request Commentterraform-plan -->